app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
---
	def index
		@articles = Article.all.order("created_at DESC").page params[:page]