app/controllers/articles_controller.rb

	def home
		@article_banner = Article.last
		@articles = Article.all.order("created_at DESC").limit(8)
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT  "articles".* FROM "articles"  ORDER BY created_at ASC LIMIT 8 OFFSET 0

	def index
		@articles = Article.all.order(:id).page params[:page]
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" ASC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "articles"

	def create
		@article = Article.new(article_params)
		if @article.save
---
INSERT INTO "articles" ("title", "author", "body", "banner_image_file_name", "banner_image_content_type", "banner_image_file_size", "banner_image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def show
		@random_article = Article.limit(3).order("RANDOM()")
---
SELECT  "articles".* FROM "articles"  ORDER BY RANDOM() LIMIT 3

	def update
		if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "author" = ?, "body" = ?, "banner_image_file_name" = ?, "banner_image_content_type" = ?, "banner_image_file_size" = ?, "banner_image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?