app/controllers/authors_controller.rb

	def create
		@author = Author.new(author_params)
		if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mason Matthews"], ["created_at", "2016-03-18 12:05:00.032448"], ["updated_at", "2016-03-18 12:05:00.032448"]]

	def show
		@articles = Article.where(:author_id => @author.id)
---
SELECT "articles".* FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 1]]

	def update
		if @author.update(author_params)
---
UPDATE "authors" SET "profile_image_file_name" = ?, "profile_image_content_type" = ?, "profile_image_file_size" = ?, "profile_image_updated_at" = ?, "updated_at" = ? WHERE "authors"."id" = ?

	def find_author
		@author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]